<?php

class AlgorithmMaker {

    public function megaliteros() {
        ?>
        <div class="container-fluid">
            <div class="row">
                <div class="col-sm ">
                    <h4 id ="max">Μεγαλύτερος - Μικρότερος</h4>
                    <p>Για να βρούμε τον μεγαλύτερο από δύο η περισσότερους αριθμούς
                        βάζουμε τον πρώτο μέσα στο max (η στο min) και συγκρίνουμε το max (η το min)με όλους τους άλλους</p> 
                    <p>ΠΡΟΣΟΧΗ: Χρησιμοποιούμε μόνο ΔΟΜΗ ΑΠΛΗΣ ΕΠΙΛΟΓΗΣ</p>
                    <p>Σε περίπτωση που γνωρίζουμε το διάστημα των τιμών μπορούμε να βάλουμε
                        στον max την μικρότερη πιθανή τιμή -1 και στο min την μεγαλύτερη πιθανή τιμή +1</p>
                    <h5>Παράδειγμα 1 (άγνωστο διάστημα τιμών)</h5>
                    <p>Μεγαλύτερος από τρεις</p>
                    <pre>
        ΔΙΑΒΑΣΕ χ,ψ,ζ
        max <-- χ   
        ΑΝ ψ > max ΤΟΤΕ
            max <-- ψ
        ΤΕΛΟΣ_ΑΝ
        ΑΝ ζ > max ΤΟΤΕ
            max <-- ζ
        ΤΕΛΟΣ_ΑΝ
                    </pre>
                    <pre>
        ΔΙΑΒΑΣΕ χ
        max <-- χ
        ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
           ΔΙΑΒΑΣΕ χ
           ΑΝ (χ > max) ΤΟΤΕ
              max <-- χ
           ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
                    </pre>
                    <pre>
        ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
            ΔΙΑΒΑΣΕ χ
            ΑΝ (i = 1) ΤΟΤΕ
                max <-- χ
            ΤΕΛΟΣ_ΑΝ
            ΑΝ (χ > max) ΤΟΤΕ
                max <-- χ
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
                    </pre>
                    <p> Η καλύτερα</p>
                    <pre>
        ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
            ΔΙΑΒΑΣΕ χ
            ΑΝ (i = 1) ΤΟΤΕ
                max <-- χ
            ΑΛΛΙΩΣ
                ΑΝ (χ > max) ΤΟΤΕ
                    max <-- χ
                ΤΕΛΟΣ_ΑΝ
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
                    </pre>
                    <h5>Παράδειγμα 2 (τιμές [1,20])</h5>
                    <pre>
        max <-- 0
        ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
            ΔΙΑΒΑΣΕ χ
            ΑΝ (χ > max) ΤΟΤΕ
                max <-- χ
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ                            
                    </pre>

                    <h5> Μεγαλύτερος άρτιος από 30 ακεραίους</h5>
                    <pre style="text-align:left">
        πρώτος <-- ΑΛΗΘΗΣ
        ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
            ΔΙΑΒΑΣΕ χ
            ΑΝ χ mod 2 = 0  ΤΟΤΕ
                ΑΝ πρώτος = ΑΛΗΘΗΣ ΤΟΤΕ
                    max <-- χ
                    πρώτος <-- ΨΕΥΔΗΣ
                ΑΛΛΙΩΣ_ΑΝ χ > max ΤΟΤΕ
                    max <-- χ
                ΤΕΛΟΣ_ΑΝ
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
        ΑΝ πρώτος = ΨΕΥΔΗΣ ΤΟΤΕ
            ΓΡΑΨΕ 'Μεγαλύτερος άρτιος ο',max
        ΑΛΛΙΩΣ
            ΓΡΑΨΕ 'Δεν δώθηκε κανένας άρτιος'
        ΤΕΛΟΣ_ΑΝ                           
                    </pre>

                    <h5> Μεγαλύτερος άρτιος μέχρι να δωθεί το 0</h5>
                    <pre>
        πρώτος <-- ΑΛΗΘΗΣ
        ΔΙΑΒΑΣΕ χ
        ΟΣΟ χ <> 0 ΕΠΑΝΑΛΑΒΕ    
            ΑΝ χ mod 2 = 0  ΤΟΤΕ
                ΑΝ πρώτος = ΑΛΗΘΗΣ ΤΟΤΕ
                    max <-- χ
                    πρώτος <-- ΨΕΥΔΗΣ
                ΑΛΛΙΩΣ_ΑΝ χ > max ΤΟΤΕ
                    max <-- χ
                ΤΕΛΟΣ_ΑΝ
            ΤΕΛΟΣ_ΑΝ
            ΔΙΑΒΑΣΕ χ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
        ΑΝ πρώτος = ΨΕΥΔΗΣ ΤΟΤΕ
            ΓΡΑΨΕ 'Μεγαλύτερος άρτιος ο',max
        ΑΛΛΙΩΣ
            ΓΡΑΨΕ 'Δεν δώθηκε κανένας άρτιος'
        ΤΕΛΟΣ_ΑΝ                           
                    </pre>

                    <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
                </div>

            </div>  
        </div>
        <?php
    }

}
