<?php

include_once 'PageMaker.php';

$page = new PageMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h3 id="askisisBoithima">Ασκήσεις που πρέπει να γίνουν από το Βοήθημα</h3>
            <p>Πριν από κάθε ομάδα ασκήσεων στο βοήθημα υπάρχουν λυμένες ασκήσεις. Τις κοιτάζουμε με προσοχή.</p>
            <h4>Τεύχος 2</h4>
            <ul>
                <li>Κεφάλαιο 1</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 7 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>1.43</li>
                    <li>1.44</li>
                    <li>1.45</li>
                    <li>1.46</li>
                    <li>1.48</li>
                    <li>1.49</li>
                    <li>1.50</li>
                    <li>1.51</li>
                    <li>1.52</li>
                    <li>1.53</li>
                    <li>1.54</li>
                    <li>1.55</li>
                    <li>1.56</li>
                    <li>1.57</li>
                    <li>1.59</li>
                </ul>
                <li>Kεφάλαιο 2</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 7 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>2.20</li>
                    <li>2.21</li>
                    <li>2.25</li>
                    <li>2.26</li>
                    <li>2.29</li>
                    <li>2.34</li>
                    <li>2.35</li>
                    <li>2.36</li>
                    <li>2.37</li>
                    <li>2.38</li>
                    <li>2.39</li>
                    <li>2.43</li>
                    <li>2.44</li>
                    <li>2.45</li>
                    <li>2.46</li>
                    <li>2.47</li>
                    <li>2.48</li>
                    <li>2.50</li>
                    <li>2.51</li>                    
                </ul>
                <li>Kεφάλαιο 3</li>
                <p>Ασκήσεις που μας μαθαίνουν το χειρισμό των πινάκων δύο διαστάσεων</p>
                <ul>
                    <li>3.24</li>
                    <li>3.27</li>
                    <li>3.29</li>
                    <li>3.30</li>
                    <li>3.31</li>
                    <li>3.32</li>
                    <li>3.33</li>
                    <li>3.34</li>
                    <li>3.35</li>
                    <li>3.36</li>
                    <li>3.37</li>
                    <li>3.38</li>
                    <li>3.39</li>
                    <li>3.40</li>
                    <li>3.41</li>
                    <li>3.42</li>
                    <li>3.43</li>
                    <li>3.44</li>
                    <li>3.45</li>
                    <li>3.46</li>

                </ul>
                <li>Kεφάλαιο 4</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>4.19</li>
                    <li>4.20</li>
                    <li>4.23</li>
                    <li>4.24</li>
                    <li>4.25</li>
                    <li>4.26</li>
                    <li>4.27</li>
                    <li>4.28</li>
                    <li>4.29</li>
                    <li>4.34</li>
                    <li>4.35</li>
                    <li>4.36</li>
                    <li>4.37</li>
                    <li>4.38</li>

                </ul>
                <li>Kεφάλαιο 5</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>5.23</li>
                    <li>5.24</li>
                    <li>5.25</li>
                    <li>5.26</li>
                    <li>5.27</li>
                    <li>5.28</li>
                    <li>5.29</li>
                    <li>5.30</li>
                    <li>5.31</li>
                    <li>5.32</li>
                    <li>5.33</li>
                    <li>5.34</li>
                    <li>5.35</li>
                    <li>5.36</li>
                </ul>
                <li>Kεφάλαιο 6</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>6.20</li>
                    <li>6.21</li>
                    <li>6.23</li>
                    <li>6.24</li>
                    <li>6.25</li>
                    <li>6.26</li>
                    <li>6.27</li>
                    <li>6.28</li>
                    <li>6.29</li>
                    <li>6.30</li>
                    <li>6.31</li>
                    <li>6.32</li>
                    <li>6.35</li>                                                    
                </ul>
                <li>Kεφάλαιο 8</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>8.5</li>
                    <li>8.8</li>
                    <li>8.9</li>
                    <li>8.10</li>
                    <li>8.11</li>
                    <li>8.12</li>
                    <li><b>8.13 Καλό σχήμα με δεδομένα οπωσδήποτε</b></li>
                    <li>8.16</li>
                    <li><b>8.17 Καλό σχήμα με δεδομένα οπωσδήποτε</b></li>
                    <li>8.18</li>
                    <li>8.19</li>
                    <li>8.20</li>
                    <li>8.24 <b>Nα γίνει οπωσδήποτε</b></li>
                    <li>8.28</li>
                    <li>8.32</li>
                    <li>8.45</li>

                </ul>
                <li>Kεφάλαιο 13</li>
<!--                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή τις οδηγίες 
                    για διαγράμματα ροής <a href="http://jhouv.eu/aepp/index.php#diagrammata">στο site του μαθήματος</a> </p>-->
                <ul>
                    <li>13.20</li>
                    <li>13.23</li>
                    <li>13.24</li>
                    <li>13.30</li>
                    <li>13.31</li>
                    <li>13.32</li>
                    <li>13.34</li>                      
                </ul>

                <li>Kεφάλαιο 14</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>14.24</li>
                    <li>14.28</li>
                    <li>14.29</li>
                    <li>14.31</li>
                    <li>14.32</li>
                    <li>14.33</li>
                    <li>14.35</li> 
                    <li>14.36</li>
                    <li>14.37</li>
                    
                </ul>
                <li>Kεφάλαιο 15</li>
                <!--<p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>-->
                <ul>
                    <li>15.23</li>
                    <li>15.24</li>
                    <li>15.25</li>
                    <li>15.26</li>
                    <li>15.27 <b>Να γίνει οπωσδήποτε</b></li>
                    <li>15.29 <b>Να γίνει οπωσδήποτε</b></li>
                    <li>15.30 <b>Να γίνει οπωσδήποτε</b></li>    
                    <li>15.34</li>
                    <li>15.36</li>
                    <li>15.37</li>
                    <li>15.38</li>
                    <li>15.39</li>
                    <li>15.49</li>
                    <li>15.50</li> 
                </ul>
<!--                <li>Kεφάλαιο 16</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 17</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>-->
            </ul>    

        </div>

    </div>  
</div>
<?php
$page->displayEndMatter();
