<?php

function __autoload($name) {
    include_once $name . '.php';
}

$page = new PageMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h3 id="askisisBoithima">Ασκήσεις που πρέπει να γίνουν από το Βοήθημα</h3>
            <p>Πριν από κάθε ομάδα ασκήσεων στο βοήθημα υπάρχουν λυμένες ασκήσεις. Τις κοιτάζουμε με προσοχή.</p>
            <h4>Τεύχος 1</h4>
            <ul>
                <li>Κεφάλαιο 2</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 7 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>2.24</li>
                    <li>2.25</li>
                    <li>2.26</li>
                    <li>2.27</li>
                    <li>2.28</li>
                    <li>2.29</li>
                    <li>2.30</li>
                    <li>2.31</li>
                    <li>2.32</li>
                    <li>2.33</li>
                    <li>2.34</li>

                </ul>
                <li>Kεφάλαιο 3</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 7 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>3.13</li>
                    <li>3.14</li>
                    <li>3.16</li>
                    <li>3.18</li>
                    <li>3.22</li>
                    <li>3.25</li>
                    <li>3.26</li>                                
                </ul>
                <li>Kεφάλαιο 4</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 7 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>4.13</li>
                    <li>4.14</li>
                    <li>4.15</li>
                    <li>4.16</li>
                    <li>4.29</li>
                    <li>4.32</li>
                    <li>4.36</li>
                    <li>4.42</li>
                    <li>4.44</li>
                    <li>4.45</li>
                    <li>4.46</li>
                    <li>4.48</li>
                    <li>4.49</li>                                
                </ul>
                <li>Kεφάλαιο 5</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>5.19</li>
                    <li>5.20</li>
                    <li>5.24</li>
                    <li>5.25</li>
                    <li>5.26</li>
                    <li>5.27</li>
                    <li>5.28</li>
                    <li>5.35</li>
                    <li>5.37</li>                                
                </ul>
                <li>Kεφάλαιο 6</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>6.20</li>
                    <li>6.24</li>
                    <li>6.28</li>
                    <li>6.39</li>
                    <li>6.40</li>
                    <li>6.47</li>
                    <li>6.48</li>                                
                </ul>
                <li>Kεφάλαιο 7</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>7.11</li>
                    <li>7.13</li>
                    <li>7.14</li>
                    <li>7.15</li>
                    <li>7.16</li>
                    <li>7.17</li>
                    <li>7.18</li>
                    <li>7.19</li>
                    <li>7.20</li>
                    <li>7.21</li>
                    <li>7.23</li>
                    <li>7.24</li>
                    <li>7.26</li>
                    <li>7.28</li>
                    <li>7.38</li>
                    <li>7.39</li>
                    <li>7.41</li>
                    <li>7.42</li>                                
                </ul>
                <li>Kεφάλαιο 8</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>8.11</li>
                    <li>8.13</li>
                    <li>8.14</li>
                    <li>8.15</li>
                    <li>8.17</li>
                    <li>8.20</li>
                    <li>8.23</li>
                    <li>8.25</li>
                    <li>8.26</li>
                    <li>8.27</li>
                    <li>8.30</li>
                    <li>8.31</li>
                    <li>8.32</li>
                    <li>8.34</li>
                    <li>8.35</li>
                    <li>8.36</li>
                    <li>8.38</li>
                    <li>8.39</li>
                    <li>8.40</li>
                    <li>8.41</li>
                    <li>8.50</li>
                    <li>8.51</li>                                                                                            
                </ul>
                <li>Kεφάλαιο 9</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή τις οδηγίες 
                    για διαγράμματα ροής <a href="http://jhouv.eu/aepp/index.php#diagrammata">στο site του μαθήματος</a> </p>
                <ul>
                    <li>9.12</li>
                    <li>9.14</li>
                    <li>9.19</li>
                    <li>9.20</li>
                    <li>9.22</li>
                    <li>9.23</li>
                    <li>9.24</li>                                
                </ul>
                <li>Kεφάλαιο 10</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο 8 του Σχολικού Βιβλίου</p>
                <ul>
                    <li>10.21</li>
                    <li>10.24</li>
                    <li>10.27</li>
                    <li>10.28</li>
                    <li>10.32</li>
                    <li>10.33</li>
                    <li>10.34</li>
                    <li>10.37</li>
                    <li>10.39</li>
                    <li>10.46</li>
                    <li>10.50</li>
                    <li>10.54</li>
                    <li>10.55</li>
                    <li>10.65</li>                                
                </ul>
                <li>Kεφάλαιο 11</li>
                <p class="font-weight-bolder">Πρέπει να μελετήσουμε όλες τις λυμένες ασκήσεις.</p>
                <ul>
                    <li>11.1 (Λυμένη Άσκηση)</li>
                    <li>11.2 (Λυμένη Άσκηση)</li>
                    <li>11.3 (Λυμένη Άσκηση)</li>
                    <li>11.4 (Λυμένη Άσκηση)</li>
                    <li>11.5 (Λυμένη Άσκηση)</li>
                    <li>11.6 (Λυμένη Άσκηση)</li>
                    <li>11.7 (Λυμένη Άσκηση)</li>
                    <li>11.8 (Λυμένη Άσκηση)</li>
                    <li>11.9 (Λυμένη Άσκηση)</li>
                    <li>11.10</li>
                    <li>11.11</li>
                    <li>11.12</li>
                    <li>11.14</li>
                    <li>11.15</li>
                    <li>11.16</li>
                    <li>11.17</li>
                    <li>11.18</li>
                    <li>11.19</li>
                    <li>11.20</li>
                    <li>11.21</li>
                    <li>11.22</li>
                    <li>11.23</li>
                    <li>11.24</li>
                    <li>11.25</li>
                    <li>11.27</li>
                    <li>11.29</li>
                    <li>11.30</li>
                    <li>11.31</li>
                    <li>11.32</li>
                    <li>11.34</li>
                    <li>11.35</li>                                
                </ul>
                <li>Kεφάλαιο 12</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 13</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 14</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 15</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 16</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
                <li>Kεφάλαιο 17</li>
                <p>Πρέπει να έχετε διαβάσει με πολύ προσοχή το κεφάλαιο  του Σχολικού Βιβλίου</p>
                <ul>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>
                    <li></li>                                
                </ul>
            </ul>    

        </div>

    </div>  
</div>
<?php
$page->displayEndMatter();
