<?php
include_once 'PageMaker.php';

$page = new PageMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>
<div class="container-fluid">
    <div class="row">
        <div class="col-lg-6">
            <h3 id="askisisBoithima">Η τελευταία μας άσκηση για φέτος</h3>
            <p>Έστω μια στοίβα ακεραίων με όνομα <b>α</b>, 10 θέσεων. Να γραφεί πρόγραμμα το οποίο θα εκτελεί τις παρακάτω
            ενέργειες εμφανίζοντας το κατάλληλο μενού επιλογής:</p>
            
            <ol>
                <li>Ώθηση στοιχείου στην στοίβα.</li>
                <li>Απώθηση στοιχείου από τη στοίβα.</li>
                <li>Άδειασμα στοίβας.</li>
                <li>Απώθηση όλων των στοιχείων της στοίβας και υπολογισμός του μέσου όρου τους.</li>
                <li>Έξοδος από το πρόγραμμα.</li> 
                Δώσε μια τιμή από 1 έως 5.
            </ol>
           
        </div>
        <div class="col-lg-6">
            <h4>Λύση</h4>
            <pre>
ΠΡΟΓΡΑΜΜΑ τελευταίαΑσκηση
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: α[10], τοπ, χ, επιλογή, πλ, σ
  ΠΡΑΓΜΑΤΙΚΕΣ: μο
ΑΡΧΗ
  τοπ <- 0
  ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
    ΓΡΑΨΕ '1. Ώθηση στοιχείου στην στοίβα  '
    ΓΡΑΨΕ '2. Απώθηση στοιχείου από τη στοίβα '
    ΓΡΑΨΕ '3. Άδειασμα της στοίβας  '
    ΓΡΑΨΕ '4. Απώθηση όλων των στοιχείων της στοίβας και υπολογισμός του μέσου όρου τους  '
    ΓΡΑΨΕ '5. Έξοδος από το πρόγραμμα  '
    ΔΙΑΒΑΣΕ επιλογή
    ΑΝ επιλογή = 1 ΤΟΤΕ
      ΑΝ τοπ < 10 ΤΟΤΕ
        ΓΡΑΨΕ 'Δώστε ένα ακέραιο αριθμό  '
        ΔΙΑΒΑΣΕ χ
        τοπ <- τοπ + 1
        α[τοπ] <- χ
      ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Η στοίβα είναι γεμάτη δεν μπορεί να γίνει ώθηση  '
      ΤΕΛΟΣ_ΑΝ
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 2 ΤΟΤΕ
      ΑΝ τοπ > 0 ΤΟΤΕ
        ΓΡΑΨΕ 'Απώθηση του  ', α[τοπ] 
        τοπ <- τοπ - 1
      ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Η στοίβα είναι άδεια δεν μπορεί να γίνει απώθηση '
      ΤΕΛΟΣ_ΑΝ
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 3 ΤΟΤΕ
      τοπ <- 0
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 4 ΤΟΤΕ
      ΑΝ τοπ <> 0 ΤΟΤΕ
        σ <- 0
        πλ <- τοπ
        ΟΣΟ τοπ <> 0 ΕΠΑΝΑΛΑΒΕ
          σ <- σ + α[τοπ] 
          τοπ <- τοπ - 1
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
        μο <- σ/πλ
        ΓΡΑΨΕ 'Ο μέσος όρος είναι  ', μο
      ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Η στοίβα είναι άδεια  '
      ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
  ΜΕΧΡΙΣ_ΟΤΟΥ επιλογή = 5
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ 
            </pre> 
        </div>
    </div>
    <div class="row">
        <div class="col-lg-6">
            <h3 id="askisisBoithima">Η τελευταία μας άσκηση για φέτος</h3>
            <p>Έστω μια στοίβα ακεραίων με όνομα <b>α</b>, 10 θέσεων. Να γραφεί πρόγραμμα το οποίο θα εκτελεί τις παρακάτω
            ενέργειες εμφανίζοντας το κατάλληλο μενού επιλογής:</p>
            
            <ol>
                <li>Ώθηση στοιχείου στην στοίβα.</li>
                <li>Απώθηση στοιχείου από τη στοίβα.</li>
                <li>Άδειασμα στοίβας.</li>
                <li>Απώθηση όλων των στοιχείων της στοίβας και υπολογισμός του μέσου όρου τους.</li>
                <li>Έξοδος από το πρόγραμμα.</li> 
                Δώσε μια τιμή από 1 έως 5.
            </ol>
            <p>Η ενέργεια 4 να γίνεται με κλήση διαδικασίας που θα δέχεται τον πίνακα και τον δείκτη τοπ.</p> 
        </div>
        <div class="col-lg-6">
            <h4>Λύση</h4>
            <pre>
ΠΡΟΓΡΑΜΜΑ τελευταίαΑσκηση
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: α[10], τοπ, χ, επιλογή, πλ, σ
  ΠΡΑΓΜΑΤΙΚΕΣ: μο
ΑΡΧΗ
  τοπ <- 0
  ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
    ΓΡΑΨΕ '1. Ώθηση στοιχείου στην στοίβα  '
    ΓΡΑΨΕ '2. Απώθηση στοιχείου από τη στοίβα '
    ΓΡΑΨΕ '3. Άδειασμα της στοίβας  '
    ΓΡΑΨΕ '4. Απώθηση όλων των στοιχείων της στοίβας και υπολογισμός του μέσου όρου τους  '
    ΓΡΑΨΕ '5. Έξοδος από το πρόγραμμα  '
    ΔΙΑΒΑΣΕ επιλογή
    ΑΝ επιλογή = 1 ΤΟΤΕ
      ΑΝ τοπ < 10 ΤΟΤΕ
        ΓΡΑΨΕ 'Δώστε ένα ακέραιο αριθμό  '
        ΔΙΑΒΑΣΕ χ
        τοπ <- τοπ + 1
        α[τοπ] <- χ
      ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Η στοίβα είναι γεμάτη δεν μπορεί να γίνει ώθηση  '
      ΤΕΛΟΣ_ΑΝ
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 2 ΤΟΤΕ
      ΑΝ τοπ > 0 ΤΟΤΕ
        ΓΡΑΨΕ 'Απώθηση του  ', α[τοπ] 
        τοπ <- τοπ - 1
      ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Η στοίβα είναι άδεια δεν μπορεί να γίνει απώθηση '
      ΤΕΛΟΣ_ΑΝ
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 3 ΤΟΤΕ
      τοπ <- 0
    ΑΛΛΙΩΣ_ΑΝ επιλογή = 4 ΤΟΤΕ
      ΚΑΛΕΣΕ απμο(α, τοπ)
    ΤΕΛΟΣ_ΑΝ
  ΜΕΧΡΙΣ_ΟΤΟΥ επιλογή = 5
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ 

ΔΙΑΔΙΚΑΣΙΑ απμο(α, τοπ)
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: α[10], τοπ, σ, πλ
  ΠΡΑΓΜΑΤΙΚΕΣ: μο
ΑΡΧΗ
  ΑΝ τοπ <> 0 ΤΟΤΕ
    σ <- 0
    πλ <- τοπ
    ΟΣΟ τοπ <> 0 ΕΠΑΝΑΛΑΒΕ
      σ <- σ + α[τοπ] 
      τοπ <- τοπ - 1
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    μο <- σ/πλ
    ΓΡΑΨΕ 'Ο μέσος όρος είναι  ', μο
  ΑΛΛΙΩΣ
    ΓΡΑΨΕ 'Η στοίβα είναι άδεια  '
  ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΔΙΑΔΙΚΑΣΙΑΣ             </pre> 
        </div>
    </div>
</div>
<?php
$page->displayEndMatter();
