<?php
include_once 'PageMaker.php';

$page = new PageMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>
<div class="container-fluid">
  <div class="row">
    <div class="col-lg-6">
      <h3 id="askisisBoithima">Η τελευταία μας άσκηση για φέτος</h3>
      <p>Να γράψετε πρόγραμμα το οποίο θα εμφανίζει το παρακάτω μενού επιλογών</p>

      <ol>
        <li>Εμβαδόν Τριγώνου.</li>
        <li>Εμβαδόν Τετραγώνου.</li>
        <li>Έξοδος από το πρόγραμμα.</li>
        Δώσε μια τιμή από 1 έως 3.
      </ol>
      <p>Αν η επιλογή του χρήστη είναι 1 ή 2, θα εκτελεί την ανάλογη ενέργεια και θα εμφανίζει πάλι το μενού επιλογής, αναμένοντας
        την επόμμενη επιλογή του χρήστη.</p>
      <p>Αν η επιλογή είναι 3, το πρόγραμμα θα τερματίζει.</p>
      <p>Για το πρόγραμμα αυτό να υλοποιήσετε υποπρογράμματα για το διάβασμα των δεδομένων τον υπολογισμό και εμφάνιση του εμβαδού του τριγώνου και του τετραγώνου.</p>
    </div>

    <div class="col-lg-6">
      <h4>Λύση</h4>
      <pre>
ΠΡΟΓΡΑΜΜΑ τελευταία2025
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ:τιμή  
ΑΡΧΗ
  ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
    ΓΡΑΨΕ '1.Εμβαδόν Τριγώνου'
    ΓΡΑΨΕ '2.Εμβαδόν Τετραγώνου'
    ΓΡΑΨΕ '3.Έξοδος από το πρόγραμμα'
    ΓΡΑΨΕ 'Δώστε μια τιμή από 1 έως 3'
    ΔΙΑΒΑΣΕ τιμή
    ΕΠΙΛΕΞΕ τιμή
      ΠΕΡΙΠΤΩΣΗ 1
        ΚΑΛΕΣΕ τρίγωνο() 
      ΠΕΡΙΠΤΩΣΗ 2
        ΚΑΛΕΣΕ τετράγωνο() 
    ΤΕΛΟΣ_ΕΠΙΛΟΓΩΝ
  ΜΕΧΡΙΣ_ΟΤΟΥ τιμή = 3
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ

ΔΙΑΔΙΚΑΣΙΑ τρίγωνο() 
ΜΕΤΑΒΛΗΤΕΣ
  ΠΡΑΓΜΑΤΙΚΕΣ: β, υ, εμβ
ΑΡΧΗ
  ΓΡΑΨΕ 'Δώστε βάση'
  ΔΙΑΒΑΣΕ β
  ΓΡΑΨΕ 'Δώστε ύψος'
  ΔΙΑΒΑΣΕ υ
  εμβ <- β*υ/2
  ΓΡΑΨΕ 'Το εμβαδόν του τριγώνου είναι ', εμβ
ΤΕΛΟΣ_ΔΙΑΔΙΚΑΣΙΑΣ

ΔΙΑΔΙΚΑΣΙΑ τετράγωνο() 
ΜΕΤΑΒΛΗΤΕΣ
  ΠΡΑΓΜΑΤΙΚΕΣ: πλευρά, εμβαδόν
ΑΡΧΗ
  ΓΡΑΨΕ 'Δώστε την πλευρά του τετραγώνου'
  ΔΙΑΒΑΣΕ πλευρά
  εμβαδόν <- πλευρά^2
  ΓΡΑΨΕ 'Το εμβαδόν του τετραγώνου είναι ', εμβαδόν
ΤΕΛΟΣ_ΔΙΑΔΙΚΑΣΙΑΣ
 
            </pre>
    </div>
  </div>

</div>
<?php
$page->displayEndMatter();
