
<?php

function __autoload($name) {
    include_once $name . '.php';
}

$page = new PageMaker();
$theory = new TheoryMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>

<!--<div class="container-fluid">-->
<!--<h1>ΑΕΠΠ</h1>-->
<?php // $page->megaliteros(); ?>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id ="max">Μεγαλύτερος - Μικρότερος</h4>
            <p>Για να βρούμε τον μεγαλύτερο (ή τον μικρότερο) από δύο η περισσότερους αριθμούς
                βάζουμε τον πρώτο μέσα στο max (ή στο min) και συγκρίνουμε το max (ή το min) με όλους τους άλλους</p> 
            <p><b>ΠΡΟΣΟΧΗ: Χρησιμοποιούμε μόνο ΔΟΜΗ ΑΠΛΗΣ ΕΠΙΛΟΓΗΣ</b></p>
            <p>Σε περίπτωση που γνωρίζουμε το διάστημα των τιμών μπορούμε να βάλουμε
                στον max την μικρότερη πιθανή τιμή -1 και στο min την μεγαλύτερη πιθανή τιμή +1 
                (πχ αν οι τιμές είναι από 1 έως 20 τότε βάζουμε στο max το 0 και στο min το 21)</p>
            <h5>Μεγαλύτερος από 3</h5>
            <pre>
ΔΙΑΒΑΣΕ α,β,γ                            
μεγ <-- α
ΑΝ β > μεγ ΤΟΤΕ
    μεγ <-- β
ΤΕΛΟΣ_ΑΝ
ΑΝ γ > μεγ ΤΟΤΕ
    μεγ <-- γ
ΤΕΛΟΣ_ΑΝ
            </pre>
            <h5>Άγνωστο διάστημα τιμών</h5>
            <pre>
ΔΙΑΒΑΣΕ χ
max <-- χ
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
    ΔΙΑΒΑΣΕ χ
    ΑΝ (χ > max) ΤΟΤΕ
        max <-- χ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
    ΔΙΑΒΑΣΕ χ
    ΑΝ (i = 1) ΤΟΤΕ
        max <-- χ
    ΤΕΛΟΣ_ΑΝ
    ΑΝ (χ > max) ΤΟΤΕ
        max <-- χ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
            <p> Η καλύτερα</p>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
    ΔΙΑΒΑΣΕ χ
    ΑΝ (i = 1) ΤΟΤΕ
        max <-- χ
    ΑΛΛΙΩΣ
        ΑΝ (χ > max) ΤΟΤΕ
            max <-- χ
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
            <h5>Τιμές [1,20]</h5>
            <pre>
max <-- 0
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
    ΔΙΑΒΑΣΕ χ
    ΑΝ (χ > max) ΤΟΤΕ
        max <-- χ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ                            
            </pre>

            <h5> Μεγαλύτερος άρτιος από 30 ακεραίους</h5>
            <pre>
πρώτος <-- ΑΛΗΘΗΣ
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 30
    ΔΙΑΒΑΣΕ χ
    ΑΝ χ mod 2 = 0  ΤΟΤΕ
        ΑΝ πρώτος = ΑΛΗΘΗΣ ΤΟΤΕ
            max <-- χ
            πρώτος <-- ΨΕΥΔΗΣ
        ΑΛΛΙΩΣ_ΑΝ χ > max ΤΟΤΕ
            max <-- χ
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΑΝ πρώτος = ΨΕΥΔΗΣ ΤΟΤΕ
    ΓΡΑΨΕ 'Μεγαλύτερος άρτιος ο',max
ΑΛΛΙΩΣ
    ΓΡΑΨΕ 'Δεν δώθηκε κανένας άρτιος'
ΤΕΛΟΣ_ΑΝ                           
            </pre>

            <h5> Μεγαλύτερος άρτιος μέχρι να δωθεί το 0</h5>
            <pre>
πρώτος <-- ΑΛΗΘΗΣ
ΔΙΑΒΑΣΕ χ
ΟΣΟ χ <> 0 ΕΠΑΝΑΛΑΒΕ    
    ΑΝ χ mod 2 = 0  ΤΟΤΕ
        ΑΝ πρώτος = ΑΛΗΘΗΣ ΤΟΤΕ
            max <-- χ
            πρώτος <-- ΨΕΥΔΗΣ
        ΑΛΛΙΩΣ_ΑΝ χ > max ΤΟΤΕ
            max <-- χ
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
    ΔΙΑΒΑΣΕ χ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΑΝ πρώτος = ΨΕΥΔΗΣ ΤΟΤΕ
    ΓΡΑΨΕ 'Μεγαλύτερος άρτιος ο',max
ΑΛΛΙΩΣ
    ΓΡΑΨΕ 'Δεν δώθηκε κανένας άρτιος'
ΤΕΛΟΣ_ΑΝ                           
            </pre>

            <h5>Δύο μεγαλύτεροι από άγνωστο αριθμό <b>θετικών</b> ακεραίων</h5>
            <pre>
ΠΡΟΓΡΑΜΜΑ μεγαλύτεροι
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: χ, μαξμαξ, μαξ
ΑΡΧΗ
  μαξμαξ <- -1
  μαξ <- -1
  ΓΡΑΨΕ 'Δώστε ακέραιο αριθμό'
  ΔΙΑΒΑΣΕ χ
  ΟΣΟ χ <> -1 ΕΠΑΝΑΛΑΒΕ
    ΑΝ χ > μαξμαξ ΤΟΤΕ
      μαξ <- μαξμαξ
      μαξμαξ <- χ
    ΑΛΛΙΩΣ_ΑΝ χ > μαξ ΚΑΙ χ <> μαξμαξ ΤΟΤΕ
      μαξ <- χ
    ΤΕΛΟΣ_ΑΝ
    ΓΡΑΨΕ 'Δώστε ακέραιο αριθμό'
    ΔΙΑΒΑΣΕ χ
  ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
  ΑΝ μαξμαξ <> -1 ΚΑΙ μαξ <> -1 ΤΟΤΕ
    ΓΡΑΨΕ 'Μεγαλύτερος είναι ο ', μαξμαξ
    ΓΡΑΨΕ 'Επόμενος είναι ο ', μαξ
  ΑΛΛΙΩΣ_ΑΝ μαξ = -1 ΤΟΤΕ
    ΓΡΑΨΕ 'Δώθηκε μόνο ένας αριθμός ο ', μαξ
  ΑΛΛΙΩΣ
    ΓΡΑΨΕ 'Δεν δώθηκε κανένας έγκυρος αριθμός'
  ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ                         </pre>

            <h5>Δύο μεγαλύτεροι από άγνωστο αριθμό ακεραίων και <b>άγνωστο διάστημα τιμών</b></h5>
            <pre>
ΠΡΟΓΡΑΜΜΑ δύοΜεγαλύτεροι
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: χ, μαξ, μαξμαξ
  ΛΟΓΙΚΕΣ: πρώτος, δεύτερος
ΑΡΧΗ
  μαξ <- -1
  μαξμαξ <- -1
  πρώτος <- ΑΛΗΘΗΣ
  δεύτερος <- ΨΕΥΔΗΣ
  ΓΡΑΨΕ 'Δώστε ακέραιο η -1 για τέλος'
  ΔΙΑΒΑΣΕ χ
  ΟΣΟ χ <> -1 ΕΠΑΝΑΛΑΒΕ
    ΑΝ πρώτος = ΑΛΗΘΗΣ ΤΟΤΕ
      μαξμαξ <- χ
      πρώτος <- ΨΕΥΔΗΣ
      δεύτερος <- ΑΛΗΘΗΣ
    ΑΛΛΙΩΣ_ΑΝ δεύτερος = ΑΛΗΘΗΣ ΤΟΤΕ
      ΑΝ χ > μαξμαξ ΤΟΤΕ
        μαξ <- μαξμαξ
        μαξμαξ <- χ
      ΑΛΛΙΩΣ
        μαξ <- χ
      ΤΕΛΟΣ_ΑΝ
      δεύτερος <- ΨΕΥΔΗΣ
    ΑΛΛΙΩΣ
      ΑΝ χ > μαξμαξ ΤΟΤΕ
        μαξ <- μαξμαξ
        μαξμαξ <- χ
      ΑΛΛΙΩΣ_ΑΝ χ > μαξ ΤΟΤΕ
        μαξ <- χ
      ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
    ΓΡΑΨΕ 'Δώστε ακέραιο η -1 για τέλος'
    ΔΙΑΒΑΣΕ χ
  ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
  ΑΝ δεύτερος = ΑΛΗΘΗΣ ΤΟΤΕ
    ΓΡΑΨΕ 'δώθηκε μόνο ένας αριθμός ο ', μαξμαξ
  ΑΛΛΙΩΣ
    ΓΡΑΨΕ 'μεγαλύτερος ο ', μαξμαξ
    ΓΡΑΨΕ 'επόμενος ο ', μαξ
  ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ 
            </pre>
            <h5>Πόσοι μαθητές είχαν τον μεγαλύτερο βαθμό</h5>
            <pre>
ΠΡΟΓΡΑΜΜΑ πόσεςΦορέςΟΜεγαλύτεροςΒαθμός
ΣΤΑΘΕΡΕΣ
  ν = 5
ΜΕΤΑΒΛΗΤΕΣ
  ΑΚΕΡΑΙΕΣ: βαθ, μαξ, πλήθος, ι
ΑΡΧΗ
  μαξ <- 0
  ΓΙΑ ι ΑΠΟ 1 ΜΕΧΡΙ ν
    ΓΡΑΨΕ 'Δώστε βαθμό'
    ΔΙΑΒΑΣΕ βαθ
    ΑΝ βαθ > μαξ ΤΟΤΕ
      μαξ <- βαθ
      πλήθος <- 1
    ΑΛΛΙΩΣ_ΑΝ βαθ = μαξ ΤΟΤΕ
      πλήθος <- πλήθος + 1
    ΤΕΛΟΣ_ΑΝ
  ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
  ΓΡΑΨΕ 'Τον μεγαλύτερο βαθμό είχαν ', πλήθος, ' μαθητές'
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ 
            </pre>
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id="akatalili">Ακατάλληλη Τιμή</h4>
            <p>Όταν ένας αλγόριθμος τελειώνει με "Ακατάλληλη Τιμή" (τιμή φρουρό)
                τότε μπορούμε να χρησιμοποιήσουμε το ΟΣΟ (συνθήκη) ΕΠΑΝΑΛΑΒΕ και
                διαβάζουμε τιμή: μια φορά πριν μπούμε και μια φορά πριν βγούμε</p> 
            <h6>Παράδειγμα</h6>
            <pre>
ΠΡΟΓΡΑΜΜΑ ακατάλληλη_Τιμή
ΜΕΤΑΒΛΗΤΕΣ
ΑΚΕΡΑΙΕΣ:μ
ΠΡΑΓΜΑΤΙΚΕΣ:σ,μο,βαθμό
ΑΡΧΗ
σ <- 0
μ <- 0
ΓΡΑΨΕ 'δώσε βαθμό Η 0 για τέλος'
ΔΙΑΒΑΣΕ βαθμό
ΟΣΟ βαθμό > 0 ΕΠΑΝΑΛΑΒΕ
    σ <- σ + βαθμό
    μ <- μ + 1
    ΓΡΑΨΕ 'δώσε βαθμό Η 0 για τέλος'
    ΔΙΑΒΑΣΕ βαθμό
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΑΝ μ <> 0 ΤΟΤΕ
    μο <- σ/μ
    ΓΡΑΨΕ μο
ΑΛΛΙΩΣ 
    ΓΡΑΨΕ 'Δεν δώθηκε κανένας βαθμός'
ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ
            </pre>
            <h5>Διαθέσιμες Ποσότητες (όχι ακατάλληλη τιμή αλλά μοιάζει)</h5>
            <pre>
ΠΡΟΓΡΑΜΜΑ άσκηση14_28Κοψίνης1
ΜΕΤΑΒΛΗΤΕΣ
  ΠΡΑΓΜΑΤΙΚΕΣ: τιμή, τσέπη, υπόλοιπο
  ΧΑΡΑΚΤΗΡΕΣ: προέλ
  ΑΚΕΡΑΙΕΣ: πλξ, πλε
ΑΡΧΗ
  τσέπη <- 1500
  πλξ <- 0
  πλε <- 0
  ΓΡΑΨΕ 'Δώστε τιμή   '
  ΔΙΑΒΑΣΕ τιμή
  ΟΣΟ τιμή <= τσέπη ΕΠΑΝΑΛΑΒΕ
        τσέπη <- τσέπη - τιμή
        ΓΡΑΨΕ 'Δώστε προέλευση "ξένο" η "ελληνικό"   '
        ΔΙΑΒΑΣΕ προέλ
        ΑΝ προέλ = 'ξένο' ΤΟΤΕ
            πλξ <- πλξ + 1
        ΑΛΛΙΩΣ
            πλε <- πλε + 1
        ΤΕΛΟΣ_ΑΝ
        ΓΡΑΨΕ 'Δώστε τιμή   '
        ΔΙΑΒΑΣΕ τιμή
  ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
  ΓΡΑΨΕ 'τέλος αγορών'
  ΑΝ τσέπη > 0 ΤΟΤΕ
        ΓΡΑΨΕ 'Περίσσεψαν  ', τσέπη
        υπόλοιπο <- 1500 - τσέπη
        ΓΡΑΨΕ 'Ξόδεψα   ', 1500 - τσέπη
        ΓΡΑΨΕ 'Αγόρασα  ',πλξ,'  ξένα  και  ',πλε,'   ελληνικά'
  ΑΛΛΙΩΣ
        ΓΡΑΨΕ 'Τα ξόδεψα όλα '
  ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ
            </pre>
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4 id="egirotita">Έλεγχος εγκυρότητας με ΟΣΟ</h4>
            <pre>  
ΓΡΑΨΕ 'Δώστε βαθμό'
ΔΙΑΒΑΣΕ βαθμό
ΟΣΟ βαθμό < 1 Η βαθμό > 20 ΕΠΑΝΑΛΑΒΕ
    ΓΡΑΨΕ 'Δώσατε λάθος, δώστε [1,20]
    ΔΙΑΒΑΣΕ βαθμό
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Έλεγχος εγκυρότητας με ΜΕΧΡΙΣ_ΟΤΟΥ</h4>
            <pre>
ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
    ΓΡΑΨΕ 'Δώσε βαθμό'
    ΔΙΑΒΑΣΕ βαθμό
ΜΕΧΡΙΣ_ΟΤΟΥ βαθμό >= 1 ΚΑΙ βαθμό <= 20
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Έλεγχος εγκυρότητας με ΜΕΧΡΙΣ_ΟΤΟΥ και μήνυμα λάθους 1</h4>
            <pre>
ΓΡΑΨΕ 'Δώσε βαθμό'
ΔΙΑΒΑΣΕ βαθμό
ΑΝ βαθμό < 1 Η βαθμό > 20 ΤΟΤΕ
    ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
        ΓΡΑΨΕ 'Δώσατε λάθος, δώστε [1,20]
        ΔΙΑΒΑΣΕ βαθμό
    ΜΕΧΡΙΣ_ΟΤΟΥ βαθμό >= 1 ΚΑΙ βαθμό <= 20
ΤΕΛΟΣ_ΑΝ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Έλεγχος εγκυρότητας με ΜΕΧΡΙΣ_ΟΤΟΥ και μήνυμα λάθους 2</h4>
            <pre>
ΓΡΑΨΕ 'Δώσε βαθμό'
ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
    ΔΙΑΒΑΣΕ βαθμό
    ΑΝ βαθμό < 1 Η βαθμό > 20 ΤΟΤΕ
        ΓΡΑΨΕ 'Δώσατε λάθος, δώστε [1,20]
    ΤΕΛΟΣ_ΑΝ    
ΜΕΧΡΙΣ_ΟΤΟΥ βαθμό >= 1 ΚΑΙ βαθμό <= 20
ΤΕΛΟΣ_ΑΝ
            </pre>
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id="1d">Εισαγωγή στους πίνακες </h4>

            <p>Εισαγωγή στους πίνακες <a href="https://youtu.be/vzbXXgeuh5U"><b>στο YouTube</b></a></p>
        </div>                     
    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id="1d">Διάβασμα πίνακα </h4>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 20
    ΔΙΑΒΑΣΕ Π[i]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ  
            </pre>
            <p>Παρουσίαση του διαβάσματος μονοδιάστατου πίνακα <a href="https://youtu.be/bJ_fF1VM7YQ"><b>στο YouTube</b></a></p>
        </div>                     
    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Άθροισμα πίνακα </h4>
            <pre>
Σ <-- 0
ΓΙΑ i ΑΠΌ 1 ΜΕΧΡΙ 20
    Σ <-- Σ + Π[i]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ  
            </pre> 
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Μέσος Όρος πίνακα </h4>
            <pre>
Σ <-- 0
ΓΙΑ i ΑΠΌ 1 ΜΕΧΡΙ 20
    Σ <-- Σ + Π[i]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΜΟ <-- Σ/20  
            </pre> 
            <p>Μέσος όρος μονοδιάστατου πίνακα <a href="https://youtu.be/rMOs-0Uep2Y"><b>στο YouTube</b></a></p>
            <p>Πόσοι είναι πάνω από τον μέσο όρο <a href="https://youtu.be/cyAFX7s61Qw"><b>στο YouTube</b></a></p>
        </div>
    </div>  
</div>


<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 >Σειριακή Αναζήτηση </h4>
            <pre>
ΔΙΑΒΑΣΕ χ
βρέθηκε <-- ΨΕΥΔΗΣ
i <-- 1
ΟΣΟ i <= 50 ΚΑΙ βρέθηκε = ΨΕΥΔΗΣ ΕΠΑΝΑΛΑΒΕ
    ΑΝ (Π[i] = χ) ΤΟΤΕ
        βρέθηκε <-- ΑΛΗΘΗΣ
        θέση <-- i
    ΑΛΛΙΩΣ
        i <-- i + 1
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ     
            </pre> 
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Ταξινόμηση Ευθείας Ανταλλαγής</h4>
            <pre>
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
    ΓΙΑ j ΑΠΟ 30 ΜΕΧΡΙ i ME BHMA -1
        AN Π[j-1] > Π[j] ΤΟΤΕ
            temp <-- Π[j-1]
            Π[j-1] <-- Π[j]
            Π[j] <-- temp
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ     
            </pre> 
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Μεγαλύτερος Πίνακα</h4>                      
            <pre>
max <-- Π[1]
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
    ΑΝ (Π[i] > max) TOTE
        max <-- Π[i]
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ     
            </pre> 
            <!-- <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>comment -->
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Το όνομα του καλύτερου μαθητή</h4>                      
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 20
    ΔΙΑΒΑΣΕ όνομα[i],βαθμός[i]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ  
max <-- βαθμός[1]
όνομαMax <-- όνομα[1]
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
    ΑΝ (βαθμός[i] > max) TOTE
        max <-- βαθμός[i]
        όνομαMax <-- όνομα[i]
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΓΡΑΨΕ 'Καλύτερος μαθητής ο',όνομαMax    
            </pre> 
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id="2d">Διάβασμα πίνακα δύο διαστάσεων</h4>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        ΔΙΑΒΑΣΕ Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre> 
        </div>

    </div>  
</div>


<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Άθροισμα και Μέσος Όρος Πίνακα</h4>
            <pre>
Σ <-- 0
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10        
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        Σ <-- Σ + Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
μο <-- Σ/80
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Άθροισμα γραμμών</h4>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    Σ[i] <-- 0
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        Σ[i] <-- Σ[i] + Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μέσος όρος γραμμών</h4>
            <pre>    
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    Σ <-- 0
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        Σ <-- Σ + Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    μο[i] <-- Σ/8
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <img src="images/athrismaMoGrammon.webp" class="img-fluid" alt="...">
        </div>
    </div>
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Άθροισμα Στηλών</h4>
            <pre>    
ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8    
    Σ[j] <-- 0
    ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
        Σ[j] <-- Σ[j] + Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μέσος όρος στηλών</h4>
            <pre>    
ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8 
    Σ <-- 0
    ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
        Σ <-- Σ + Π[i,j]
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    μο[j] <-- Σ/10
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>
    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <img src="images/mesosOrosStilon.webp" class="img-fluid" alt="...">
        </div>
    </div>
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος πίνακα</h4>
            <pre>    
max <-- Π[1,1]
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        ΑΝ Π[i,j] > max TOTE
            max <-- Π[i,j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <img src="images/maxPinaka.webp" class="img-fluid" alt="...">
        </div>
    </div>
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτεροι γραμμών</h4>
            <pre>    
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    max[i] <-- Π[i,1]
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
        ΑΝ Π[i,j] > max[i] ΤΟΤΕ
            max[i] <-- Π[i,j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτεροι στηλών</h4>
            <pre>    
ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
    max[j] <-- Π[1,j]
    ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
        ΑΝ Π[i,j] > max[i] ΤΟΤΕ
            max[j] <-- Π[i,j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος 3ης γραμμής (Π[5,10])</h4>
            <pre>    
max <-- Π[3,1]
ΓΙΑ j ΑΠΟ 2 ΜΕΧΡΙ 8
    ΑΝ Π[3,j] > max ΤΟΤΕ
        max[i] <-- Π[3,j]
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος 3ης στήλης (Π[5,10])</h4>
            <pre>    
max <-- Π[1,3]
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 10
    ΑΝ Π[i,3] > max ΤΟΤΕ
        max[i] <-- Π[i,3]
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μέσος όρος 3ης γραμμής (Π[5,10])</h4>
            <pre>    
Σ <-- 0
ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 8
    Σ <-- Σ + Π[3,j]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
MO <-- Σ/8
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μέσος όρος 3ης στήλης (Π[5,10])</h4>
            <pre>    
Σ <-- 0
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 10
    Σ <-- Σ + Π[i,3]
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
MO <-- Σ/10
            </pre>
        </div>

    </div>  
</div>


<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος διαγωνίου i = j (Π[5,5]) Α Τρόπος</h4>
            <pre>    
max <-- Π[1,1]
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 5
    ΑΝ Π[i,i] > max
        max <-- Π[i,i]
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος διαγωνίου i = j (Π[5,5]) Β Τρόπος</h4>
            <pre>    
max <-- Π[1,1]
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 5
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 5
        ΑΝ Π[i,j] > max ΚΑΙ i = j ΤΟΤΕ
            max <-- Π[i,j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Μεγαλύτερος διαγωνίου  i + j = 6 (Π[5,5])</h4>
            <pre>    
max <-- Π[1,5]
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 5
    ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 5
        ΑΝ Π[i,j] > max ΚΑΙ i + j = 6 ΤΟΤΕ
            max <-- Π[i,j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm">
            <h4>Σειριακή αναζήτηση του Χ σε πίνακα δύο διαστάσεων Π[20,30]</h4>
            <pre>    
βρέθηκε <-- ΨΕΥΔΗΣ
i <-- 1
ΟΣΟ i <= 20 και βρέθηκε = ΨΕΥΔΗΣ ΕΠΑΝΑΛΑΒΕ
    j <-- 1
    ΟΣΟ j <= 30 ΚΑΙ βρέθηκε = ΨΕΥΔΗΣ ΕΠΑΝΑΛΑΒΕ
        ΑΝ Π[i,j] = Χ ΤΟΤΕ
            βρέθηκε <-- ΑΛΗΘΗΣ
        ΑΛΛΙΩΣ
            j <-- j + 1
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    i <-- i + 1
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
            </pre>
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Ταξινόμηση Ευθείας Ανταλλαγής όλων των γραμμών πίνακα (Π[20,30])</h4>
            <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 20
    ΓΙΑ k ΑΠΟ 2 ΜΕΧΡΙ 30
        ΓΙΑ j ΑΠΟ 30 ΜΕΧΡΙ k ME BHMA -1
            AN Π[i,j-1] > Π[i,j] ΤΟΤΕ
                temp <-- Π[i,j-1]
                Π[i,j-1] <-- Π[i,j]
                Π[i,j] <-- temp
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ    
            </pre> 
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Ταξινόμηση Ευθείας Ανταλλαγής όλων των στηλών πίνακα (Π[20,30])</h4>
            <pre>
ΓΙΑ j ΑΠΟ 1 ΜΕΧΡΙ 30
    ΓΙΑ k ΑΠΟ 2 ΜΕΧΡΙ 20
        ΓΙΑ i ΑΠΟ 20 ΜΕΧΡΙ k ME BHMA -1
            AN Π[i-1,j] > Π[i,j] ΤΟΤΕ
                temp <-- Π[i-1,j]
                Π[i-1,j] <-- Π[i,j]
                Π[i,j] <-- temp
            ΤΕΛΟΣ_ΑΝ
        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ    
            </pre> 
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Ταξινόμηση Ευθείας Ανταλλαγής 3η γραμμή (Π[20,30])</h4>
            <pre>
ΓΙΑ i ΑΠΟ 2 ΜΕΧΡΙ 30
    ΓΙΑ j ΑΠΟ 30 ΜΕΧΡΙ i ME BHMA -1
        AN Π[3,j-1] > Π[3,j] ΤΟΤΕ
            temp <-- Π[3,j-1]
            Π[3,j-1] <-- Π[3,j]
            Π[3,j] <-- temp
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ     
            </pre> 
        </div>

    </div>  
</div>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4>Ταξινόμηση Ευθείας Ανταλλαγής 3η στήλη (Π[20,30])</h4>
            <pre>
ΓΙΑ k ΑΠΟ 2 ΜΕΧΡΙ 20
    ΓΙΑ i ΑΠΟ 20 ΜΕΧΡΙ k ME BHMA -1
        AN Π[i-1,3] > Π[i,3] ΤΟΤΕ
            temp <-- Π[i-1,3]
            Π[i-1,3] <-- Π[i,3]
            Π[i,3] <-- temp
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ     
            </pre> 
            <a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>
        </div>

    </div>  
</div>
<div class="container-fluid">
    <div class="row">
        <div class="col-sm ">
            <h4 id="diagrammata">Διαγράμματα Ροής</h4>
            <p>Όταν σε ένα διάγραμμα ροής συναντήσουμε <b>ρόμβο</b> (συνθήκη) τότε
                αυτό που ακολουθάει είναι <b>Δομή Επιλογής</b> Η <strong> Δομή Επανάληψης</strong> και:     
            </p> 
            <ol>
                <li>Αν το <b>ΝΑΙ και το ΟΧΙ βρίσκονται</b>, τότε είναι <b>δομή επιλογής</b>
                    και στο σημείο που συναντόνται γράφουμε ΤΕΛΟΣ_ΑΝ</li>
                <li>Αν το <b>ΝΑΙ και το ΟΧΙ δεν βρίσκονται</b> ποτέ, τότε είναι
                    <b>δομή επανάληψης</b> και:</li>
                <ul>
                    <li>Αν η επανάληψη <b>τελειώνει με ΟΧΙ</b>, τότε είναι <b>ΟΣΟ</b></li>
                    <li>Αν η επανάληψη <b>τελειώνει με ΝΑΙ</b> τότε είναι <b>ΜΕΧΡΙΣ_ΟΤΟΥ</b> και
                        στο σημείο που επιστρέφει, γράφουμε <b>ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ</b></li>
                </ul>
            </ol>
            <p><b>Προσοχή:</b> Η δομή επανάληψης <b>ΓΙΑ..ΑΠΟ..ΜΕΧΡΙ..</b> δεν έχει δικό της διάγραμμα ροής
                πρέπει να μετατρέψουμε σε <b>ΟΣΟ..ΕΠΑΝΑΛΑΒΕ</b> και να κάνουμε το αντίστοιχο διάγραμμα ροής.</p>
            <!--<a href="#menu" class="btn bg-dark btn-block" role="button">Μενού</a>-->
        </div>

    </div>  
</div>
<?php
$theory->chapter01();
$theory->chapter02();
$theory->chapter03();
$theory->enotita01();
$theory->chapter06();
$theory->chapter07();
$theory->chapter08();
$theory->chapter09();
$theory->chapter10();
$theory->chapter13();
$theory->domi();
?>

<div class="container-fluid">
    <h4 id="moreAlgorithms">Άλγόριθμοι Αναζήτησης - Ταξινόμησης - Συγχώνευσης</h4>
    <p><strong>Προσοχή:</strong> </p>
    <div id="accordion">
        <div class="card">
            <div class="card-header">
                <a class="card-link" data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                    Δυαδική Αναζήτηση
                </a>
            </div>
            <div id="collapseOne" class="collapse show">
                <div class="card-body">
                    <pre>
ΓΡΑΨΕ 'Δωσε τιμή για αναζήτηση: '
ΔΙΑΒΑΣΕ S
Left <- 1
Right <- 20
k <- 0
f <- ΨΕΥΔΗΣ
ΟΣΟ (Left <= Right) ΚΑΙ (f = ΨΕΥΔΗΣ) ΕΠΑΝΑΛΑΒΕ
    M <- (Left + Right) DIV 2
    ΑΝ A[M] = S ΤΟΤΕ
        k <- M
        f <- ΑΛΗΘΗΣ
    ΑΛΛΙΩΣ
        ΑΝ A[M] < S ΤΟΤΕ
            Left <- M + 1
        ΑΛΛΙΩΣ
            Right <- M - 1
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΑΝ f = ΑΛΗΘΗΣ ΤΟΤΕ
    ΓΡΑΨΕ "Το στοιχείο,", S, "υπάρχει στη θέση:", M
ΑΛΛΙΩΣ
    ΓΡΑΨΕ "Το στοιχείο,", S, " δεν υπάρχει στον πίνακα"
ΤΕΛΟΣ_ΑΝ                                    
                    </pre>
                </div>
            </div>
        </div>

        <div class="card">
            <div class="card-header">
                <a class="collapsed card-link" data-toggle="collapse" data-parent="#accordion" href="#collapseTwo">
                    Έξυπνη ταξινόμηση ευθείας ανταλλαγής
                </a>
            </div>
            <div id="collapseTwo" class="collapse">
                <div class="card-body">
                    <P>Η ταξινόμηση ευθείας ανταλλαγής όπως την ξέρουμε δεν είναι και τόσο
                        έξυπνη αφού ακόμα και αν ο πίνακας είναι ήδη ταξινομημένος θα δουλέψει όσες 
                        φορές ορίζουν τα δύο ΓΙΑ. Τον κάνουμε λίγο πιο έξυπνο μετατρέποντας την εξωτερική
                        ΓΙΑ σε ΟΣΟ και προσθέτοντας μια λογική μεταβλητή που τον σταματάει αν σε κάποιο πέρασμα του πίνακα
                        δεν γίνει αντιμετάθεση (ο πίνακας θα έχει ταξινομηθεί)</P>
                    <pre>
i <-- 2
αντιμετάθεση <-- ΑΛΗΘΗΣ
ΟΣΟ i <= 30 KAI αντιμετάθεση = ΑΛΗΘΗΣ ΕΠΑΝΑΛΑΒΕ
    αντιμετάθεση <-- ΨΕΥΔΗΣ
    ΓΙΑ j ΑΠΟ 30 ΜΈΧΡΙ i ΜΕ ΒΗΜΑ -1
        ΑΝ Π[j-1] < Π[j] ΤΟΤΕ
            temp <-- Π[j-1]
            Π[j-1]<-- Π[j]
            Π[j] <-- temp
            αντιμεταθεση <-- ΑΛΗΘΗΣ
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    i <-- i + 1
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
                    </pre>
                </div>
            </div>
        </div>
        <div class="card">
            <div class="card-header">
                <a class="collapsed card-link" data-toggle="collapse" data-parent="#accordion" href="#collapseThree">
                    Ταξινόμηση με επιλογή
                </a>
            </div>
            <div id="collapseThree" class="collapse">
                <div class="card-body">
                    <p>Πως κάνει την ταξινόμηση?</p>
                    <pre>
ΓΙΑ i ΑΠΟ 1 ΜΕΧΡΙ 19
    θ <- i
    x <- A[i]
    ΓΙΑ j ΑΠΟ i + 1 ΜΕΧΡΙ 20
        ΑΝ x > A[j] ΤΟΤΕ
            θ <- j
            x <- A[j]
        ΤΕΛΟΣ_ΑΝ
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
    A[θ] <- A[i]
    A[i] <- x
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ                                    
                    </pre>
                </div>
            </div>
        </div>


        <div class="card">
            <div class="card-header">
                <a class="collapsed card-link" data-toggle="collapse" data-parent="#accordion" href="#collapseFour">
                    Συγχώνευση
                </a>
            </div>
            <div id="collapseFour" class="collapse">
                <div class="card-body">
                    <pre>
! Συγχώνευση πινάκων
! I είναι ο δείκτης για τον πίνακα Α
! J είναι ο δείκτης για τον πίνακα Β
! Κ είναι ο δείκτης για τον πίνακα Γ
I <- 1
J <- 1
Κ <- 1
ΟΣΟ I <= Ν ΚΑΙ J <= Μ ΕΠΑΝΑΛΑΒΕ
! Όσο και τα δύο έχουν στοιχεία
    ΑΝ Α[Ι] < B[J] ΤΟΤΕ
        Γ[Κ] <- Α[I]
        Κ <- Κ+1
        I <- Ι+1
    ΑΛΛΙΩΣ
        Γ[Κ] <- B[J]
        Κ <- Κ+1
        J <- J +1
    ΤΕΛΟΣ_ΑΝ
ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
! Μεταφορά των υπολοίπων στοιχείων του Α ή του Β
ΑΝ I > Ν ΤΟΤΕ
    ΓΙΑ Λ ΑΠΟ Κ ΜΕΧΡΙ Ν+Μ
        Γ[Λ] <- B[J]
        J <- J +1
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ
ΑΛΛΙΩΣ
    ΓΙΑ Λ ΑΠΟ Κ ΜΕΧΡΙ Ν+Μ
        Γ[Λ] <- Α[I]
        I <- Ι+1
    ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ 
ΤΕΛΟΣ_ΑΝ                                   
                    </pre>
                </div>
            </div>
        </div>
        <!--                    <div class="card">
                                <div class="card-header">
                                    <a class="collapsed card-link" data-toggle="collapse" data-parent="#accordion" href="#collapseThree">
                                        Ταξινόμηση με επιλογή
                                    </a>
                                </div>
                                <div id="collapseThree" class="collapse">
                                    <div class="card-body">
                                        <pre>
                                            
                                        </pre>
                                    </div>
                                </div>
                            </div>-->
    </div>
</div>

<!--</div>-->
<footer>
    <div class="container">Αντώνης Χουβαρδάς 2021-22.
        <p>Όποιος θέλει μπορεί ελεύθερα να το μοιράσει,
            να το αλλάξει, να το παρουσιάσει σαν δικό του</p>
    </div></footer>
</body>
</html>
