<?php
include_once 'PageMaker.php';

$page = new PageMaker();
$page->displayHeadMatter();
$page->displayMenu();
?>


<div class="container-fluid p-5 bg-success text-white">
    <h1>Συνταγή για επιτυχία στις εξετάσεις</h1> 
</div>

<div class="container mt-3">
    <div class="row">
        <div class="col-lg-4">
            <h3>Το πιο σημαντικό</h3>
            <p>Έχουμε δουλέψει όλο το χρόνο και είμαστε <b>ETOIMOI</b></p>
            <p>Πάμε λοιπόν με θράσος στις εξετάσεις, δεν έχουμε αμφιβολίες <b>θα γράψουμε σίγουρα καλά</b></p>
            <p><b>Πάμε με νοοτροπία νικητή και κερδίζουμε ένα 10% τουλάχιστον παραπάνω.</b></p>
        </div>
        <div class="col-lg-4">
            <h3>Διαβάζουμε τις εκφωνήσεις τόσες φορές όσες χρειάζεται για τις μάθουμε απέξω</h3>
            <p>Πρέπει να μπορούμε να περιγράψουμε το πρόβλημα σε κάποιον χωρίς να κοιτάζουμε την εκφώνηση.</p>
            <p>Αυτό είναι το μυστικό της επιτυχίας, αν γνωρίζουμε καλά το πρόβλημα, μόνο τότε μπορούμε να το λύσουμε</p>
            <p></p>
        </div>
        <div class="col-lg-4">
            <h3>Σημειώνουμε τα ερωτήματα</h3>        
            <p>Φτιάχνουμε στο πρόχειρο μια λίστα με τα ερωτήματα</p>
            <ul>
                <li>Θέμα Α</li>
                <ol>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                </ol>
                <li>Θέμα Β</li>
                <ol>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                </ol>
                <li>Θέμα Γ</li>
                <ol>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                </ol>
                <li>Θέμα Δ</li>
                <ol>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                    <li>Ερώτημα</li>
                </ol>
            </ul>
            <p>Σημειώνουμε με  <b>"v"</b> τα ερωτήματα που ξέρουμε τέλεια με <b>"+"</b> αυτά που ξέρουμε έτσι και έτσι και με  <b>"x"</b> αυτά που δεν ξέρουμε καθόλου</p>
            <p>Η λίστα μας τώρα πρέπει να είναι κάπως έτσι: (βασικά ελπίζω να είναι όλα  <b>"v"</b>)</p>
            <ul>
                <li>Θέμα Α</li>
                <ol>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>+</b></li>
                </ol>
                <li>Θέμα Β</li>
                <ol>
                    <li>Ερώτημα <b>x</b></li>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>v</b></li>
                </ol>
                <li>Θέμα Γ</li>
                <ol>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>+</b></li>
                </ol>
                <li>Θέμα Δ</li>
                <ol>
                    <li>Ερώτημα <b>v</b></li>
                    <li>Ερώτημα <b>+</b></li>
                    <li>Ερώτημα <b>x</b></li>
                </ol>
            </ul>
            <p>Τώρα είσαστε έτοιμοι να αρχίσετε να γράφετε, ξεκινάτε με τα  <b>"v"</b> (αυτά που ξέρετε τέλεια) συνεχίζεται με τα  <b>"+"</b> και τελευταία αφήνετε τα  <b>"x"</b></p>
            <p><b>ΕΝΝΟΕΙΤΑΙ ότι προσέχετε και διαχειρίζεστε σωστά το χρόνο σας, μόνο τότε έχουν σημασία οι παραπάνω οδηγίες.</b></p>
        
        </div>
        <h1><p>Καλή Επιτυχία</p></h1>
        <hr>
        <h1><p>ΠΡΟΣΟΧΗ</p></h1></p><h5> Χρησιμοποιούμε πίνακες μόνο αν ξέρουμε το μέγεθός τους ή αν το ζητάει η εκφώνηση.</h5>
    </div>
</div>
<?php
$page->displayEndMatter();
